# Курс Интерактивный тренажер по SQL

# Выборка данных

In [ ]:
# Задачаие
Выбрать названия книг и авторов из таблицы book, для поля title задать имя(псевдоним) Название, для поля author –  Автор.
# Решение
SELECT title AS Название, author AS Автор
FROM book;

In [ ]:
# Задачание
Для упаковки каждой книги требуется один лист бумаги, цена которого 1 рубль 65 копеек. 
Посчитать стоимость упаковки для каждой книги (сколько денег потребуется, чтобы упаковать 
все экземпляры книги). В запросе вывести название книги, ее количество и стоимость
упаковки, последний столбец назвать pack
# Решение
SELECT title, amount,
    amount * 1.65 AS pack
FROM book;

In [ ]:
# Задание
В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, 
который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. 
Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.
# Решение
SELECT title, author, amount,
ROUND(price*0.7, 2) AS new_price
FROM book;

In [ ]:
# Задание
При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Михаила Булгакова, 
на втором месте книги Сергея Есенина. Исходя из этого решили поднять цену книг Булгакова на 10%, 
а цену книг Есенина - на 5%. Написать запрос, куда включить автора, название книги и 
новую цену, последний столбец назвать new_price. Значение округлить до двух знаков после запятой.
# Решение
select 
  author, 
  title,
  round(if(author="Булгаков М.А.", price*1.1, if(author="Есенин С.А.", price*1.05, price)), 2) as new_price
from book

In [ ]:
# Задание
Вывести автора, название  и цены тех книг, количество которых меньше 10.
# Решение
SELECT  author, title, price 
FROM book
WHERE amount < 10;

In [ ]:
# Задание
Вывести название, автора,  цену  и количество всех книг, цена которых меньше 500 или больше 600, 
а стоимость всех экземпляров этих книг больше или равна 5000.
# Решение
SELECT title, author, price, amount
FROM book
WHERE price <price*amount >= 5000 OR price > 600 AND price*amount >= 5000;

In [ ]:
# Задание
Вывести название и авторов тех книг, цены которых принадлежат интервалу от 540.50 до 800 
(включая границы),  а количество или 2, или 3, или 5, или 7 .
# Решение
SELECT title, author
FROM book
WHERE price BETWEEN 540.5 AND 800 AND amount in (2,3,5,7)

In [ ]:
# Задание
Вывести  автора и название  книг, количество которых принадлежит интервалу от 2 до 14 (включая границы). 
Информацию  отсортировать сначала по авторам 
(в обратном алфавитном порядке), а затем по названиям книг (по алфавиту).
# Решение
SELECT author, title
FROM book
WHERE  amount BETWEEN 2 AND 14 
ORDER BY author DESC, title;

In [ ]:
#Задание
Вывести название и автора тех книг, название которых состоит из двух и более слов, а инициалы автора содержат букву
«С». Считать, что в названии слова отделяются друг от друга пробелами и не содержат знаков препинания, между фамилией 
автора и инициалами обязателен пробел, инициалы записываются 
без пробела в формате: буква, точка, буква, точка. Информацию отсортировать по названию книги в алфавитном порядке.
# Решение
SELECT title, author FROM book WHERE author LIKE '_%С.%' and title LIKE '_% %'ORDER BY title ASC;

# Запросы, групповые операции

In [ ]:
# Задание
Отобрать различные (уникальные) элементы столбца amount таблицы book.
# Решение
SELECT DISTINCT amount
FROM book

In [ ]:
# Задание
Посчитать, количество различных книг и количество экземпляров книг каждого автора , хранящихся на складе.  
Столбцы назвать Автор, Различных_книг и Количество_экземпляров соответственно.
# Решение
SELECT author AS Автор, count(title) as "Различных_книг", sum(amount) as "Количество_экземпляров"
from book
group by author

In [ ]:
# Задание
Вывести фамилию автора, минимальную, максимальную и среднюю цену книг каждого автора . 
Вычисляемые столбцы назвать Минимальная_цена, Максимальная_цена и Средняя_цена соответственно.
# Решение
SELECT author, MIN(price) AS Минимальная_цена, MAX(price) AS Максимальная_цена, AVG(prIce) AS Средняя_цена
FROM book
GROUP BY author;

In [ ]:
# Задание
Для каждого автора вычислить суммарную стоимость книг S (имя столбца Стоимость), а также вычислить 
налог на добавленную стоимость  для полученных сумм (имя столбца НДС ) , который включен в стоимость и составляет 
k = 18%,  а также стоимость книг  (Стоимость_без_НДС) без него. 
Значения округлить до двух знаков после запятой. В запросе для расчета НДС(tax)  и Стоимости без НДС(S_without_tax) 
# Решение
select 
  author, 
  sum(price*amount) as Стоимость, 
  round(sum(price*amount)*0.18/1.18, 2) as НДС, 
  round(sum(price*amount)/1.18, 2) as Стоимость_без_НДС
from book
group by author

In [ ]:
# Задание
Вывести  цену самой дешевой книги, цену самой дорогой и среднюю цену книг на складе. 
Названия столбцов Минимальная_цена, Максимальная_цена, 
Средняя_цена соответственно. Среднюю цену округлить до двух знаков после запятой.
# Решение
select min(price) as Минимальная_цена, max(price) as Максимальная_цена, round(avg(price), 2) as Средняя_цена
from book

In [ ]:
# Задание
Вычислить среднюю цену и суммарную стоимость тех книг, количество экземпляров которых принадлежит интервалу 
от 5 до 14, включительно. 
Столбцы назвать Средняя_цена и Стоимость, значения округлить до 2-х знаков после запятой.
# Решение
SELECT ROUND(AVG(price), 2) AS Средняя_цена, ROUND(SUM(amount*price), 2) AS Стоимость
FROM book
where amount between 5 and 14

In [ ]:
# Задание
Посчитать стоимость всех экземпляров каждого автора без учета книг «Идиот» и «Белая гвардия». 
В результат включить только тех авторов, у которых суммарная стоимость книг более 5000 руб. 
Вычисляемый столбец назвать Стоимость. Результат отсортировать по убыванию стоимости.
# Решение
SELECT  author, SUM(price*amount) AS Стоимость
FROM book
WHERE title not in ("Идиот", "Белая гвардия")
GROUP BY author
HAVING SUM(price*amount) > 5000
order by Стоимость desc;

# Вложенные запросы

In [ ]:
# Задание
Вывести информацию (автора, название и цену) о  книгах, цены которых меньше или равны средней цене книг на складе. 
Информацию вывести в отсортированном по убыванию цены виде. Среднее вычислить как среднее по цене книги.
# Решение
SELECT author, title, price
FROM book
WHERE price <= (
    SELECT AVG(price)
    FROM book
)
ORDER BY price DESC;

In [ ]:
# Задание
Вывести информацию (автора, название и цену) о тех книгах, цены которых превышают минимальную цену 
книги на складе не более чем на 150 рублей в отсортированном по возрастанию цены виде.
# Решение
SELECT author, title, price
FROM book
WHERE price - (
    SELECT MIN(price)
    FROM book) <=150
order by price asc

In [ ]:
# Задание
Вывести информацию (автора, книгу и количество) о тех книгах, 
количество экземпляров которых в таблице book не дублируется.
# Решение
SELECT  author, title, amount
FROM book
WHERE amount IN (
    SELECT amount
    FROM book
    GROUP BY amount
    having count(amount)=1)

In [ ]:
# Задание
Вывести информацию о книгах(автор, название, цена), 
цена которых меньше самой большой из минимальных цен, вычисленных для каждого автора.
# Решение
SELECT author, title, price
FROM book  
WHERE price < ANY (
    SELECT MIN(price)
    FROM book
    GROUP BY author
);

In [ ]:
# Задание
Посчитать сколько и каких экземпляров книг нужно заказать поставщикам, чтобы на складе 
стало одинаковое количество экземпляров каждой книги, равное значению самого большего 
количества экземпляров одной книги на складе. Вывести название книги, ее автора, 
текущее количество экземпляров на складе и количество заказываемых экземпляров книг. 
Последнему столбцу присвоить имя Заказ.
# Решение
select title, author, amount, (select max(amount) from book) - amount as Заказ
from book
having Заказ > 0

# Запросы корректировки данны

In [ ]:
# Задание
Создать таблицу поставка (supply), которая имеет ту же структуру, что и таблиц book
# Решение
create table supply(supply_id INT PRIMARY KEY AUTO_INCREMENT, title VARCHAR(50),
                    author VARCHAR(30), price DECIMAL(8, 2), amount INT);

In [ ]:
# Задание
Занесите в таблицу supply четыре записи, чтобы получилась следующая таблица.
# Решение
insert into supply(supply_id, title, author, price, amount) values (1, 'Лирика', 'Пастернак Б.Л.', 518.99, 2);
insert into supply(supply_id, title, author, price, amount) values (2, 'Черный человек', 'Есенин С.А.', 570.20, 6);
insert into supply(supply_id, title, author, price, amount) values (3, 'Белая гвардия', 'Булгаков М.А.', 540.50, 7);
insert into supply(supply_id, title, author, price, amount) values (4, 'Идиот', 'Достоевский Ф.М.', 360.80, 3);

In [ ]:
# Задание
Добавить из таблицы supply в таблицу book, все книги, кроме книг, написанных Булгаковым М.А. и Достоевским Ф.М.
# Решение
INSERT INTO book (title, author, price, amount) 
SELECT title, author, price, amount 
FROM supply
WHERE author not in ('Булгаков М.А.', 'Достоевский Ф.М.')

In [ ]:
# Задание
Занести из таблицы supply в таблицу book только те книги, авторов которых нет в  book.
# Решение
insert into book (title, author, price, amount)
select title, author, price, amount
from supply
where author not in (select distinct author from book)

In [ ]:
# Задание
Уменьшить на 10% цену тех книг в таблице book, количество которых принадлежит интервалу от 5 до 10, включая границы.
# Решение
UPDATE book 
SET price = 0.9 * price 
WHERE amount BETWEEN 5 AND 10 ;

SELECT * FROM book;

In [ ]:
# Задание
В таблице book необходимо скорректировать значение для покупателя в столбце buy таким образом,
чтобы оно не превышало количество экземпляров книг, указанных в столбце amount.
А цену тех книг, которые покупатель не заказывал, снизить на 10%.
# Решение
update book set buy = if(buy > amount, amount, buy),
                price = if(buy = 0, price * 0.9, price);

In [ ]:
Задание
Для тех книг в таблице book , которые есть в таблице supply, не только увеличить их 
количество в таблице book ( увеличить их количество на значение столбца amountтаблицы supply), но и пересчитать их цену 
(для каждой книги найти сумму цен из таблиц book и supply и разделить на 2).
# Решение
update book, supply 
set book.amount=supply.amount+book.amount, book.price=(book.price+supply.price)/2
where book.title=supply.title

In [ ]:
#vЗадание
Удалить из таблицы supply книги тех авторов, общее количество экземпляров книг которых в таблице book превышает 10.
# Решение
delete from supply 
where author in (
  select author
  from book
  group by author
  having sum(amount) > 10
)

In [ ]:
# Задание
Создать таблицу заказ (ordering), куда включить авторов и названия тех книг, 
количество экземпляров которых в таблице book меньше среднего количества экземпляров книг в 
таблице book. В таблицу включить столбец   amount, 
в котором для всех книг указать одинаковое значение - среднее количество экземпляров книг в таблице book.
# Решение
create table ordering as
select author, title, (select avg(amount) from book) as amount
from book
where amount<(select avg(amount) from book);

# Таблица "Командировки", запросы на выборку

In [ ]:
# Задание
Вывести из таблицы trip информацию о командировках тех сотрудников, фамилия 
которых заканчивается на букву «а», в отсортированном по убыванию даты последнего дня командировки виде. 
В результат включить столбцы name, city, per_diem, date_first, date_last.
# Решение
SELECT name, city, per_diem, date_first, date_last
FROM trip
WHERE name LIKE '%а %.'
ORDER BY date_last DESC;

In [ ]:
# Задание
Вывести в алфавитном порядке фамилии и инициалы тех сотрудников, которые были в командировке в Москве.
# Решение
SELECT distinct name 
FROM trip
WHERE city='Москва'
ORDER BY name;

In [ ]:
# Задание
Для каждого города посчитать, сколько раз сотрудники в нем были.  Информацию вывести в отсортированном в 
алфавитном порядке по названию городов. Вычисляемый столбец назвать Количество. 
# Решение
select city, count(*) as Количество
from trip
group by city
order by city

In [ ]:
# Задание
Вывести два города, в которых чаще всего были в командировках сотрудники. Вычисляемый столбец назвать Количество.
# Решение
select city, count(*) as Количество
from trip
group by city
order by Количество desc
limit 2

In [ ]:
# Задание
Вывести информацию о командировках во все города кроме Москвы и Санкт-Петербурга 
(фамилии и инициалы сотрудников, город ,  длительность командировки в днях, при этом первый и 
последний день относится к периоду командировки). Последний столбец назвать Длительность. Информацию вывести 
в упорядоченном по убыванию длительности поездки, а потом по убыванию названий городов 
(в обратном алфавитном порядке).
# Решение
select name, city, datediff(date_last, date_first)+1 as Длительность
from trip
where city not in ('Москва', "Санкт-Петербург")
order by Длительность desc, city desc

In [ ]:
# Задание
Вывести информацию о командировках сотрудника(ов), которые были самыми короткими по времени. 
В результат включить столбцы name, city, date_first, date_last.
# Решение
select name, city, date_first, date_last
from trip
where DATEDIFF(date_last, date_first) = (
    select MIN(DATEDIFF(date_last, date_first))
    from trip
)

In [ ]:
# Задание
Вывести информацию о командировках, начало и конец которых относятся к одному месяцу (год может быть любой). 
В результат включить столбцы name, city, date_first, date_last. 
Строки отсортировать сначала  в алфавитном порядке по названию города, а затем по фамилии сотрудника 
# Решение
select name, city, date_first, date_last
from trip
where month(date_last)=month(date_first)
order by city, name

In [ ]:
# Задание
Вывести название месяца и количество командировок для каждого месяца. Считаем, что командировка 
относится к некоторому месяцу, если она началась в этом месяце. Информацию вывести сначала в отсортированном по 
убыванию количества, а потом в алфавитном порядке по названию месяца виде. Название столбцов – Месяц и Количество.
# Решение
select MONTHNAME(date_first) as Месяц, count(*) as Количество
from trip
group by Месяц
order by Количество desc, Месяц

In [ ]:
# Задание
Вывести сумму суточных (произведение количества дней командировки и размера суточных) 
для командировок, первый день которых пришелся на февраль или март 2020 года. Значение 
суточных для каждой командировки занесено в столбец per_diem. Вывести фамилию и инициалы 
сотрудника, город, первый день командировки и сумму суточных. Последний столбец назвать Сумма. 
Информацию отсортировать сначала 
в алфавитном порядке по фамилиям сотрудников, а затем по убыванию суммы суточных.
# Решение
select name, city, date_first, per_diem*(datediff(date_last, date_first)+1) as Сумма
from trip
where month(date_first) in (2, 3)
order by name, Сумма desc

# Таблица "Нарушения ПДД", запросы корректировки

In [ ]:
# Задание
Создать таблицу fine следующей структуры:

Поле	Описание
fine_id	ключевой столбец целого типа с автоматическим увеличением значения ключа на 1
name	строка длиной 30
number_plate	строка длиной 6
violation	строка длиной 50
sum_fine	вещественное число, максимальная длина 8, количество знаков после запятой 2
date_violation	дата
date_payment	дата
# Решение
CREATE TABLE fine(fine_id INT PRIMARY KEY AUTO_INCREMENT, name VARCHAR(30),number_plate VARCHAR(6), 
                  violation VARCHAR(50), sum_fine DECIMAL(8,2), date_violation DATE, date_payment DATE);

In [ ]:
# Задание
В таблицу fine первые 5 строк уже занесены. Добавить в таблицу записи с ключевыми значениями 6, 7, 8.
6	Баранов П.Е.	Р523ВТ	Превышение скорости
(от 40 до 60)	 	2020-02-14	 
7	Абрамова К.А.	О111АВ	Проезд на
запрещающий сигнал	 	2020-02-23	 
8	Яковлев Г.Р.	Т330ТТ	Проезд на
запрещающий сигнал	 	2020-03-03	
# Решение
insert into fine(fine_id, name, number_plate, violation, sum_fine, date_violation, date_payment) 
           values(6, "Баранов П.Е.", 'Р523ВТ', 'Превышение скорости(от 40 до 60)', Null, '2020-02-14', Null);
insert into fine(fine_id, name, number_plate, violation, sum_fine, date_violation, date_payment) 
           values(7, "Абрамова К.А.", 'О111АВ', 'Проезд на запрещающий сигнал', Null, '2020-02-23', Null);
insert into fine(fine_id, name, number_plate, violation, sum_fine, date_violation, date_payment) 
           values(8, "Яковлев Г.Р.", 'Т330ТТ', 'Проезд на запрещающий сигнал', Null, '2020-03-03', Null);

In [ ]:
# Задание
Занести в таблицу fine суммы штрафов, которые должен оплатить водитель, 
в соответствии с данными из таблицы traffic_violation. При этом суммы заносить только в пустые поля столбца  sum_fine.
Таблица traffic_violationсоздана и заполнена.
Важно! Сравнение значения столбца с пустым значением осуществляется с помощью оператора IS NULL.
# Решение
Update fine as f, traffic_violation as tv
set f.sum_fine=tv.sum_fine
where f.violation=tv.violation and f.sum_fine is null

In [ ]:
# Задание
Вывести фамилию, номер машины и нарушение только для тех водителей, которые на одной машине нарушили одно и то же правило   
два и более раз. При этом учитывать все нарушения, независимо от того оплачены они или нет. 
Информацию отсортировать в алфавитном порядке, сначала по фамилии водителя, потом по номеру машины и, наконец, по нарушению
# Решение
select name, number_plate, violation
from fine
group by name, number_plate, violation
having count(*) > 1
order by name

In [ ]:
# Задание
В таблице fine увеличить в два раза сумму неоплаченных штрафов для отобранных на предыдущем шаге записей. 
# Решение
update fine, (select name, number_plate, violation
from fine
group by name, number_plate, violation
having count(*) > 1
order by name) as new_fine
set fine.sum_fine=fine.sum_fine*2
where date_payment is null and 
           new_fine.name=fine.name and 
           new_fine.number_plate=fine.number_plate and 
           new_fine.violation=fine.violation

In [ ]:
# Задание
Водители оплачивают свои штрафы. В таблице payment занесены даты их оплаты:

payment_id	name	number_plate	violation	date_violation	date_payment
1	Яковлев Г.Р.	М701АА	Превышение скорости
(от 20 до 40)	2020-01-12	2020-01-22
2	Баранов П.Е.	Р523ВТ	Превышение скорости
(от 40 до 60)	2020-02-14	2020-03-06
3	Яковлев Г.Р.	Т330ТТ	Проезд на
запрещающий сигнал	2020-03-03	2020-03-23
Необходимо:

в таблицу fine занести дату оплаты соответствующего штрафа из таблицы payment; 
уменьшить начисленный штраф в таблице fine в два раза  (только для тех штрафов, 
                                                        информация о которых занесена в таблицу payment) ,
если оплата произведена не позднее 20 дней со дня нарушения.
# Решение
update fine, payment
set fine.date_payment=payment.date_payment,
fine.sum_fine=if(datediff(payment.date_payment, fine.date_violation) <= 20, fine.sum_fine/2, fine.sum_fine)
where fine.name=payment.name and 
fine.number_plate=payment.number_plate and 
fine.violation=payment.violation and  
fine.date_payment is null

In [ ]:
# Задание
Создать новую таблицу back_payment, куда внести информацию о неоплаченных штрафах 
(Фамилию и инициалы водителя, номер машины, нарушение, сумму штрафа  и  дату нарушения) из таблицы fine
# Решение
create table back_payment as (select name, number_plate, violation, sum_fine, date_violation from fine
where date_payment is null)

In [ ]:
# Задание
Удалить из таблицы fine информацию о нарушениях, совершенных раньше 1 февраля 2020 года. 
# Решение
delete from fine
where date_violation < '2020-02-01'

# Связи между таблицами

In [ ]:
# Задание
Создать таблицу author следующей структуры:

Поле	Тип, описание
author_id	INT PRIMARY KEY AUTO_INCREMENT
name_author	VARCHAR(50)
# Решение
create table author(author_id INT PRIMARY KEY AUTO_INCREMENT, name_author VARCHAR(50))

In [ ]:
# Задание
Заполнить таблицу author. В нее включить следующих авторов:

Булгаков М.А.
Достоевский Ф.М.
Есенин С.А.
Пастернак Б.Л.
# Решение
insert into author(author_id, name_author)
values
(1, 'Булгаков М.А.'),
(2, 'Достоевский Ф.М.'),
(3, 'Есенин С.А.'),
(4, 'Пастернак Б.Л.')

In [ ]:
# Задание
Перепишите запрос на создание таблицы book , чтобы ее структура соответствовала структуре, показанной на логической схеме (таблица genre уже создана, порядок следования столбцов - как на логической схеме в таблице book, genre_id  - внешний ключ) . Для genre_id ограничение о недопустимости пустых значений не задавать. В качестве главной таблицы для описания поля  genre_idиспользовать таблицу genre следующей структуры:

Поле	Тип, описание
genre_id	INT PRIMARY KEY AUTO_INCREMENT
name_genre	VARCHAR(30)
# Решение
CREATE TABLE book (
      book_id INT PRIMARY KEY AUTO_INCREMENT, 
      title VARCHAR(50), 
      author_id INT NOT NULL, 
      genre_id INT,
      price DECIMAL(8,2), 
      amount INT, 
      FOREIGN KEY (author_id)  REFERENCES author (author_id),
      FOREIGN KEY (genre_id)  REFERENCES genre (genre_id)
)

In [ ]:
# Задание
Создать таблицу book той же структуры, что и на предыдущем шаге. Будем считать, 
что при удалении автора из таблицы author, должны удаляться все записи о книгах из таблицы book, написанные этим автором. 
А при удалении жанра из таблицы genre для соответствующей записи book установить значение Null в столбце genre_id
# Решение
CREATE TABLE book (
      book_id INT PRIMARY KEY AUTO_INCREMENT, 
      title VARCHAR(50), 
      author_id INT, 
    genre_id INT,
      price DECIMAL(8,2), 
      amount INT, 
      FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,
      FOREIGN KEY (genre_id)  REFERENCES genre (genre_id) ON DELETE set null
)

In [ ]:
# Задание
Добавьте три последние записи (с ключевыми значениями 6, 7, 8) в таблицу book, первые 5 записей уже добавлены:
# Решение
insert into book (book_id, title, author_id, genre_id, price, amount)
values 
    (6, "Стихотворения и поэмы", 3, 2, 650.00, 15),
    (7, "Черный человек", 3, 2, 570.20, 6),
    (8, "Лирика", 4, 2, 518.99, 2)

# Запросы на выборку, соединение таблиц

In [ ]:
# Задание
Вывести название, жанр и цену тех книг, количество которых больше 8, в отсортированном по убыванию цены виде.
# Решение
select title, name_genre, price
from book
inner join genre
on genre.genre_id=book.genre_id
where amount > 8
order by price desc

In [ ]:
# Задание
Вывести все жанры, которые не представлены в книгах на складе.
# Решение
select name_genre 
from genre
left join book
on book.genre_id=genre.genre_id
where amount is null

In [ ]:
# Задание
Есть список городов, хранящийся в таблице cityж:
Необходимо в каждом городе провести выставку книг каждого автора в течение 2020 года.
Дату проведения выставки выбрать случайным образом. Создать запрос, который выведет город, автора и дату проведения выставки. 
Последний столбец назвать Дата. 
Информацию вывести, отсортировав сначала в алфавитном порядке по названиям городов, а потом по убыванию дат 
проведения выставок.
# Решение
SELECT
    name_city,
    name_author,
    DATE_ADD('2020-01-01', INTERVAL FLOOR(RAND()*365) DAY) AS Дата
FROM city,author
ORDER BY
    name_city ASC,
    Дата DESC;

In [ ]:
# Задание
Вывести информацию о книгах (жанр, книга, автор), 
относящихся к жанру, включающему слово «роман» в отсортированном по названиям книг виде.
# Решение
select name_genre, title, name_author 
from book
inner join author
on book.author_id=author.author_id
inner join genre
on book.genre_id=genre.genre_id
where name_genre='Роман'
order by title

In [ ]:
# Задание
Посчитать количество экземпляров  книг каждого автора из таблицы author.  Вывести тех авторов,  
количество книг которых меньше 10, в 
отсортированном по возрастанию количества виде. Последний столбец назвать Количество
# Решение
select name_author, sum(amount) as Количество
from author
left join book on author.author_id=book.author_id
group by name_author
having sum(amount) < 10 or Количество is null
order by Количество

In [ ]:
# Задание
Вывести в алфавитном порядке всех авторов, которые пишут только в одном жанре. Поскольку у нас в таблицах так занесены данные, 
что у каждого автора книги только в одном жанре,  для этого запроса внесем изменения в таблицу book. Пусть у нас  книга 
Есенина «Черный человек» 
относится к жанру «Роман», а книга Булгакова «Белая гвардия» к «Приключениям» (эти изменения в таблицы уже внесены).
# Решение
select name_author from book
inner join author
on author.author_id=book.author_id
group by name_author
having count(distinct genre_id) = 1

In [ ]:
# Задание
Вывести информацию о книгах (название книги, фамилию и инициалы автора, название жанра, 
цену и количество экземпляров книги), написанных в самых популярных жанрах, в отсортированном в 
алфавитном порядке по названию книг виде. Самым популярным считать жанр, 
общее количество экземпляров книг которого на складе максимально.
# Решение
select title, name_author, genre_name.name_genre, price, amount
from book
inner join author on author.author_id=book.author_id
inner join (select genre.genre_id, genre.name_genre from (SELECT genre_id, SUM(amount) AS sum_amount
FROM book
GROUP BY genre_id
HAVING sum_amount >= MAX(sum_amount)) as pop_genre
join genre on genre.genre_id=pop_genre.genre_id) as genre_name
on book.genre_id=genre_name.genre_id
order by title

In [ ]:
# Задание
Если в таблицах supply  и book есть одинаковые книги, которые имеют равную цену,  вывести их название и автора, а также посчитать общее количество экземпляров книг
в таблицах supply и book,  столбцы назвать Название, Автор  и Количество.
# Решение
SELECT book.title AS Название, name_author AS Автор, book.amount + supply.amount AS Количество
FROM author INNER JOIN book
USING (author_id)
INNER JOIN supply
ON book.title = supply.title AND author.name_author = supply.author
WHERE book.price = supply.price;

In [ ]:
# Задание
Придумайте один или несколько запросов для таблиц book,  author, genre и city. Проверьте, правильно ли они работают.
При желании можно формулировку запросов  разместить в комментариях. 
Размещенные задания можно использовать для закрепления материала урока.
Оценивайте понравившиеся Вам запросы.
В последнем модуле создан отдельный урок, в котором мы разместим запросы, набравшие наибольшее количество лайков.
# Решение
SELECT title, name_author, price
FROM author
INNER JOIN book
ON author.author_id = book.author_id;

# Запросы корректировки, соединение таблиц

In [ ]:
# Задание
Для книг, которые уже есть на складе (в таблице book), но по другой цене, чем в поставке (supply),  
необходимо в таблице book увеличить количество на значение, указанное в поставке,  и пересчитать цену.
А в таблице  supply обнулить количество этих книг.
# Решение
update book 
inner join author on book.author_id=author.author_id
inner join supply on book.title=supply.title and supply.author = author.name_author
set book.price=if(book.price <> supply.price, (book.price * book.amount + supply.price * supply.amount)/(book.amount+supply.amount), book.price),
book.amount=book.amount+supply.amount,
supply.amount=0
where book.price <> supply.price;

In [ ]:
# Задание
Включить новых авторов в таблицу author с помощью запроса на добавление, а затем вывести все данные из таблицы author.  
Новыми считаются авторы, которые есть в таблице supply, но нет в таблице author.
# Решение
insert into author(author_id, name_author)
select supply_id as author_id, author from supply
left join author
on supply.author=author.name_author
where author_id is null

In [ ]:
# Задание
Добавить новые книги из таблицы supply в таблицу book на 
основе сформированного выше запроса. Затем вывести для просмотра таблицу book
# Решение
insert into book(title, author_id, price, amount)
SELECT title, author_id, price, amount
FROM author INNER JOIN supply
     ON author.name_author = supply.author
WHERE amount <> 0

In [ ]:
# Задание
Занести для книги «Стихотворения и поэмы» Лермонтова жанр «Поэзия», 
а для книги «Остров сокровищ» Стивенсона - «Приключения». (Использовать два запроса).
# Решение
UPDATE book
SET genre_id = (SELECT genre_id 
                FROM genre 
                WHERE name_genre = 'Поэзия')
WHERE genre_id is null and book_id=10;

UPDATE book
SET genre_id = (SELECT genre_id 
                FROM genre 
                WHERE name_genre = 'Приключения')
WHERE genre_id is null and book_id=11;

In [ ]:
#Задание
Удалить всех авторов и все их книги, общее количество книг которых меньше 20.
# Решение
delete from author
where author_id in (select author_id from book
                    group by author_id
                    having sum(amount) < 20)

In [ ]:
# Задание
Удалить все жанры, к которым относится меньше 4-х книг. В таблице book для этих жанров установить значение Null.
# Решение
delete from genre
where genre_id in (select genre_id from book
                    group by genre_id
                   having count(genre_id)<3)

In [ ]:
# Задание
Удалить всех авторов, которые пишут в жанре "Поэзия". Из таблицы book удалить все книги этих авторов.
В запросе для отбора авторов использовать полное название жанра, а не его id.
# Решение
DELETE FROM author
USING author INNER JOIN book 
ON author.author_id = book.author_id
INNER JOIN genre
ON genre.genre_id = book.genre_id
WHERE name_genre = "Поэзия";

SELECT * FROM author;
SELECT * FROM book;

# База данных «Интернет-магазин книг», запросы на выборку

In [ ]:
# Задание
Вывести все заказы Баранова Павла (id заказа, какие книги, по какой цене и в каком количестве он заказал) 
в отсортированном по номеру заказа и названиям книг виде.
# Решение
select buy.buy_id, book.title, book.price, buy_book.amount from client
inner join buy on client.client_id=buy.client_id
inner join buy_book on buy.buy_id=buy_book.buy_id
inner join book on book.book_id=buy_book.book_id
where client.client_id=1
order by buy_id, title;

In [ ]:
# Задание
Посчитать, сколько раз была заказана каждая книга, для книги вывести ее автора 
(нужно посчитать, в каком количестве заказов фигурирует каждая книга).  
Вывести фамилию и инициалы автора, название книги, последний столбец назвать Количество. 
Результат отсортировать сначала  по фамилиям авторов, а потом по названиям книг.
# Решение
select name_author, book.title, count(buy_book.book_id) as Количество 
from book
    left join buy_book
    on book.book_id = buy_book.book_id
    inner join author
        on book.author_id = author.author_id
group by book.book_id
order by name_author, title;

In [ ]:
# Задание 
Вывести города, в которых живут клиенты, оформлявшие заказы в интернет-магазине. 
Указать количество заказов в каждый город, этот столбец назвать Количество. Информацию вывести по 
убыванию количества заказов, а затем в алфавитном порядке по названию городов.
# Решение
select name_city, count(*) as Количество from buy
inner join client
on client.client_id=buy.client_id
inner join city
on city.city_id=client.city_id
group by name_city

In [ ]:
# Задание
Вывести номера всех оплаченных заказов и даты, когда они были оплачены.
# Решение
select buy_id, date_step_end from buy_step
where step_id=1 and date_step_end is not null

In [ ]:
# Задание
Вывести информацию о каждом заказе: его номер, кто его сформировал (фамилия пользователя) и его стоимость 
(сумма произведений количества заказанных книг и их цены), 
в отсортированном по номеру заказа виде. Последний столбец назвать Стоимость.
# Решение
select buy.buy_id, name_client, sum(buy_book.amount*book.price) as Стоимость from buy
join client on buy.client_id=client.client_id
join buy_book on buy_book.buy_id=buy.buy_id
join book on book.book_id=buy_book.book_id
group by buy.buy_id
order by buy.buy_id

In [ ]:
# Задание
Вывести номера заказов (buy_id) и названия этапов,  на которых они в данный момент находятся. Если заказ доставлен –  
информацию о нем не выводить. Информацию отсортировать по возрастанию buy_id.
# Решение
select buy.buy_id, step.name_step from buy
join buy_step on buy_step.buy_id=buy.buy_id
join step on step.step_id=buy_step.step_id
where date_step_beg is not null and date_step_end is null

In [ ]:
# Задание
В таблице city для каждого города указано количество дней, за которые заказ может быть доставлен в этот 
город (рассматривается только этап Транспортировка). Для тех заказов, которые прошли этап транспортировки, 
вывести количество дней за которое заказ реально доставлен в город. А также, если заказ доставлен с опозданием, 
указать количество дней задержки, в противном случае вывести 0. В результат включить номер заказа (buy_id), а 
также вычисляемые столбцы Количество_дней и Опоздание. 
Информацию вывести в отсортированном по номеру заказа виде
# Решение
select buy.buy_id, 
  datediff(buy_step.date_step_end, buy_step.date_step_beg) as Количество_дней, 
  if(city.days_delivery-datediff(buy_step.date_step_end, buy_step.date_step_beg)>=0, 0, datediff(buy_step.date_step_end, buy_step.date_step_beg) - city.days_delivery) as Опоздание  
from city
join client on client.city_id=city.city_id
join buy on buy.client_id=client.client_id
join buy_step on buy_step.buy_id=buy.buy_id
where buy_step.step_id=3 and buy_step.date_step_end is not null
order by buy.buy_id

In [ ]:
# Задание
Вывести жанр (или жанры), в 
котором было заказано больше всего экземпляров книг, указать это количество. Последний столбец назвать Количество
# Решение
select name_genre, sum(buy_book.amount) as Количество from buy_book
join book on book.book_id=buy_book.book_id
join genre on genre.genre_id=book.genre_id
group by genre.genre_id, name_genre
limit 1

In [ ]:
# Задание
Для каждой отдельной книги необходимо вывести информацию о количестве проданных экземпляров и их стоимости за 
текущий и предыдущий год . 
Вычисляемые столбцы назвать Количество и Сумма. Информацию отсортировать по убыванию стоимости.
# Решение
SELECT title, SUM(Количество_1) AS Количество, SUM(Сумма_1) AS Сумма
FROM

(
SELECT title, SUM(buy_book.amount) AS Количество_1, SUM(buy_book.amount * book.price) AS Сумма_1
FROM book
LEFT JOIN buy_book
USING (book_id)
LEFT JOIN buy
USING (buy_id)
LEFT JOIN (buy_step)
USING (buy_id)
LEFT JOIN step    
USING (step_id)
WHERE name_step = "Оплата" AND buy_step.date_step_end IS NOT NULL
GROUP BY title
    
UNION
    
SELECT title, SUM(buy_archive.amount) AS Количество_1, SUM(buy_archive.amount * buy_archive.price) AS Сумма_1
FROM book
LEFT JOIN buy_archive
USING (book_id)    
LEFT JOIN buy_step
USING (buy_id) 
WHERE buy_step.step_id = 1 OR buy_step.step_id IS NULL
GROUP BY title
)query_in


GROUP BY title
ORDER BY Сумма DESC;

# База данных «Интернет-магазин книг», запросы корректировки

In [ ]:
# Задание
Включить нового человека в таблицу с клиентами. Его имя Попов Илья, его email popov@test, проживает он в Москве.
# Решение
INSERT INTO client (name_client, city_id, email) 
SELECT 'Попов Илья', city_id, 'popov@test'
FROM city
WHERE name_city = 'Москва';

In [ ]:
# Задание
Создать новый заказ для Попова Ильи. Его комментарий для заказа: «Связаться со мной по вопросу доставки».
# Решение
INSERT INTO buy(buy.buy_description,buy.client_id)
SELECT 'Связаться со мной по вопросу доставки', client_id
FROM client
WHERE client.name_client = 'Попов Илья';
SELECT * FROM buy;

In [ ]:
# Задание
В таблицу buy_book добавить заказ с номером 5. Этот заказ должен содержать книгу 
Пастернака «Лирика» в количестве двух экземпляров и книгу Булгакова «Белая гвардия» в одном экземпляре.
# Решение
insert into buy_book(buy_id, book_id, amount)
values (5, 8, 2);
insert into buy_book(buy_id, book_id, amount)
values (5, 2, 1);

In [ ]:
# Задание
Количество тех книг на складе, которые 
были включены в заказ с номером 5, уменьшить на то количество, которое в заказе с номером 5  указано.
# Решение
UPDATE book 
     INNER JOIN buy_book
     on book.book_id = buy_book.book_id
           SET book.amount = book.amount-buy_book.amount   
WHERE buy_book.buy_id = 5 ;

In [ ]:
# Задание
Создать счет (таблицу buy_pay) на оплату заказа с номером 5, в который включить название книг, 
их автора, цену, количество заказанных книг и  стоимость. Последний столбец назвать Стоимость. 
Информацию в таблицу занести в отсортированном по названиям книг виде.
# Решение
create table buy_pay(title varchar(50), name_author varchar(30), price decimal(8,2), amount int, Стоимость decimal(8,2)); 

insert into buy_pay (title, name_author, price, amount, Стоимость) 
select book.title, author.name_author, book.price, buy_book.amount, book.price*buy_book.amount from author 
inner join book on author.author_id = book.author_id 
inner join buy_book on book.book_id = buy_book.book_id 
where buy_book.buy_id = 5 
order by title;

In [ ]:
# Задание
Создать общий счет (таблицу buy_pay) на оплату заказа с номером 5. Куда включить номер заказа, количество книг в заказе 
(название столбца Количество) и его общую стоимость (название столбца Итого). Для решения используйте ОДИН запрос
# Решение
create table buy_pay
select buy_id, sum(buy_book.amount) as Количество, sum(price*buy_book.amount) as Итого from buy_book
inner join book on book.book_id=buy_book.book_id
where buy_id=5
group by buy_id

In [ ]:
# Задание
В таблицу buy_step для заказа с номером 5 включить все этапы из таблицы step,
которые должен пройти этот заказ. В столбцы date_step_beg и date_step_end всех записей занести Null.
# Решение
insert into buy_step(buy_id, step_id)
select buy_id, step_id from buy
cross join step
where buy_id=5

In [ ]:
# адание
В таблицу buy_step занести дату 12.04.2020 выставления счета на оплату заказа с номером 5.
Правильнее было бы занести не конкретную, а текущую дату. Это можно сделать с помощью функции Now(). Но при этом в разные дни 
будут вставляться разная дата, и задание нельзя будет проверить, поэтому  вставим дату 12.04.2020.
# Решение
update buy_step
set date_step_beg='2020-04-12'
where buy_id=5 and step_id=1

In [ ]:
# Задание
Завершить этап «Оплата» для заказа с номером 5, вставив в столбец date_step_end дату 13.04.2020, и начать следующий этап 
(«Упаковка»), задав в столбце date_step_beg для этого этапа ту же дату.
Реализовать два запроса для завершения этапа и начала следующего. Они должны быть записаны в общем виде, чтобы его можно было применять 
для любых этапов, изменив только текущий этап. Для примера пусть это будет этап «Оплата».
# Решение
update buy_step
set date_step_end='2020-04-13'
where buy_id=5 and step_id=1;

update buy_step
set date_step_beg='2020-04-13'
where buy_id=5 and step_id=2;

# База данных «Тестирование», запросы на выборку

In [ ]:
# Задание
Вывести студентов, которые сдавали дисциплину «Основы баз данных», указать дату попытки и результат. 
Информацию вывести по убыванию результатов тестирования.
# Решение
select name_student, date_attempt, result from student
join attempt on attempt.student_id=student.student_id
join subject on subject.subject_id=attempt.subject_id
where name_subject='Основы баз данных'
order by result desc

In [ ]:
# Задание
Вывести, сколько попыток сделали студенты по каждой дисциплине, а также средний результат попыток, 
который округлить до 2 знаков после запятой. Под результатом попытки понимается процент правильных 
ответов на вопросы теста, который занесен в столбец result.  В результат включить название дисциплины, 
а также вычисляемые столбцы Количество и Среднее. Информацию вывести по убыванию средних результатов.
# Решение
select name_subject, count(result) as Количество, round(avg(result), 2) as Среднее from subject
left join attempt on subject.subject_id=attempt.subject_id
group by name_subject

In [ ]:
# Задание
Если студент совершал несколько попыток по одной и той же дисциплине, то вывести разницу в днях между первой
и последней попыткой. В результат включить фамилию и имя студента, название дисциплины и вычисляемый столбец 
Интервал. Информацию вывести по возрастанию разницы. Студентов, сделавших одну попытку по дисциплине, не учитывать. 
# Решение
select name_student, name_subject, datediff(max(date_attempt), min(date_attempt)) as Интервал from attempt
join student on student.student_id=attempt.student_id
join subject on subject.subject_id=attempt.subject_id
group by name_student, name_subject
having count(*)>1
order by Интервал

In [ ]:
# Задание
Студенты могут тестироваться по одной или нескольким дисциплинам (не обязательно по всем). 
Вывести дисциплину и количество уникальных студентов (столбец назвать Количество), которые по ней проходили тестирование . Информацию отсортировать сначала по убыванию количества, а потом по названию дисциплины. В результат включить и дисциплины, 
тестирование по которым студенты еще не проходили, в этом случае указать количество студентов 0.
# Решение
select name_subject, count(distinct attempt.student_id) as Количество from subject
left join attempt on attempt.subject_id=subject.subject_id
group by subject.subject_id
order by name_subject, Количество desc

In [ ]:
# Задание
Случайным образом отберите 3 вопроса по дисциплине «Основы баз данных». 
В результат включите столбцы question_id и name_question.
# Решение
select question_id, name_question from question
join subject on subject.subject_id=question.subject_id
where subject.name_subject='Основы баз данных'
order by rand()
limit 3

In [ ]:
# Задание
Вывести вопросы, которые были включены в тест для Семенова Ивана по дисциплине «Основы SQL» 2020-05-17  
(значение attempt_id для этой попытки равно 7). Указать, какой ответ дал студент и правильный он или нет 
(вывести Верно или Неверно). 
В результат включить вопрос, ответ и вычисляемый столбец  Результат.
# Решение
select name_question, name_answer, if(is_correct, 'Верно', 'Неверно') as Результат from question
join testing on question.question_id=testing.question_id
join answer on answer.answer_id=testing.answer_id
where testing.attempt_id=7

In [ ]:
# Задание 
Для каждого вопроса вывести процент успешных решений, то есть отношение количества верных ответов
к общему количеству ответов, значение округлить до 2-х знаков после запятой. Также вывести название предмета, 
к которому относится вопрос, и общее количество ответов на этот вопрос. В результат включить название дисциплины, 
вопросы по ней (столбец назвать Вопрос), а также два вычисляемых столбца Всего_ответов и Успешность. 
Информацию отсортировать сначала по названию дисциплины, потом по убыванию успешности, а потом по тексту вопроса 
в алфавитном порядке.

Поскольку тексты вопросов могут быть длинными, обрезать их 30 символов и добавить многоточие "...".
# Решение
select 
name_subject, 
concat(left(name_question, 30), '...') as Вопрос, 
count(*) as Всего_ответов,
round(sum(is_correct)/count(*)*100, 2) as Успешность 
from subject
join question on question.subject_id=subject.subject_id
join testing on question.question_id=testing.question_id
join answer on answer.answer_id=testing.answer_id
group by question.question_id
order by name_subject, Успешность desc, Вопрос

In [ ]:
# Задание
В таблицу attempt включить новую попытку для студента Баранова Павла по дисциплине 
«Основы баз данных». Установить текущую дату в качестве даты выполнения попытки.
# Решение
insert into attempt(student_id, subject_id, date_attempt, result)
values (1, 2, now(), null)

In [ ]:
# Задание 
Случайным образом выбрать три вопроса (запрос) по дисциплине, тестирование по которой 
собирается проходить студент, занесенный в таблицу attempt последним, и добавить их в таблицу testing. 
id последней попытки получить как максимальное значение id из таблицы attempt.
# Решение
insert into testing(attempt_id, question_id)
select attempt_id, question.question_id from question
join subject on subject.subject_id=question.subject_id
join attempt on attempt.subject_id=question.subject_id
where subject.subject_id=2 and attempt_id=(select max(attempt_id) from attempt)
order by rand()
limit 3

In [ ]:
# Задание
Студент прошел тестирование (то есть все его ответы занесены в таблицу testing), далее необходимо вычислить результат(запрос) 
и занести его в таблицу attempt для соответствующей попытки.  Результат попытки вычислить как количество правильных ответов, 
деленное на 3 
(количество вопросов в каждой попытке) и умноженное на 100. Результат округлить до целого.
# Решение
update attempt,
(
    select student.student_id, subject.subject_id, date_attempt, round(sum(is_correct)/3*100) as result from answer
    join testing on testing.answer_id=answer.answer_id
    join attempt on attempt.attempt_id=testing.attempt_id
    join subject on subject.subject_id=attempt.subject_id
    join student on student.student_id=attempt.student_id
    where attempt.attempt_id=8
    group by student.student_id, subject.subject_id, date_attempt
) as tmp
set attempt.result=tmp.result
where attempt_id=8;

In [ ]:
# Задание
Удалить из таблицы attempt все попытки, выполненные раньше 1 мая 2020 года. Также удалить и все соответствующие этим 
попыткам вопросы из таблицы testing, которая создавалась следующим запросом:
# Решение
delete from attempt
where date_attempt < '2020-05-01'

# База данных «Абитуриент», запросы на выборку

In [ ]:
# Задание
Вывести абитуриентов, которые хотят поступать на образовательную программу 
«Мехатроника и робототехника» в отсортированном по фамилиям виде.
# Решение
select name_enrollee from enrollee
join program_enrollee on program_enrollee.enrollee_id=enrollee.enrollee_id
join program on program_enrollee.program_id=program.program_id
where program.name_program="Мехатроника и робототехника"
order by name_enrollee

In [ ]:
# Задание
Вывести образовательные программы, на которые для поступления необходим предмет «Информатика». 
Программы отсортировать в обратном алфавитном порядке.
# Решение
select name_program from program
join program_subject on program_subject.program_id=program.program_id
join subject on subject.subject_id=program_subject.subject_id
where name_subject='Информатика'

In [ ]:
# Задание
Выведите количество абитуриентов, сдавших ЕГЭ по каждому предмету, максимальное, минимальное и среднее значение 
баллов по предмету ЕГЭ. Вычисляемые столбцы назвать Количество, Максимум, Минимум, Среднее. Информацию отсортировать 
по названию предмета в алфавитном порядке, 
среднее значение округлить до одного знака после запятой.
# Решение
select 
  name_subject, 
  count(*) as Количество, 
  max(result) as Максимум, 
  min(result) as Минимум, 
  round(avg(result), 1) as Среднее 
from subject
join enrollee_subject on enrollee_subject.subject_id=subject.subject_id
group by name_subject
order by name_subject

In [ ]:
# Задание
Вывести образовательные программы, которые имеют самый большой план набора,  вместе с этой величиной.
# Решение
select name_program, plan from program
where plan=(select max(plan) from program)

In [ ]:
# Задание
Выведите сколько человек подало заявление на каждую образовательную программу и конкурс на нее 
(число поданных заявлений деленное на количество мест по плану), округленный до 2-х знаков после запятой. 
В запросе вывести название факультета, к которому относится образовательная программа, название образовательной программы, 
план набора абитуриентов на образовательную программу (plan), количество поданных заявлений (Количество) и Конкурс. 
Информацию отсортировать в порядке убывания конкурса.
# Решение
select 
  name_department, 
  p.name_program, plan, 
  count(*) as Количество, round(count(*)/plan, 2) as Конкурс 
from program_enrollee pe
join program p on pe.program_id=p.program_id
join department d on d.department_id=p.department_id
group by name_department, p.name_program, plan
order by plan, name_program desc

In [ ]:
# Задание
Вывести образовательные программы, на которые для поступления необходимы предмет 
«Информатика» и «Математика» в отсортированном по названию программ виде.
# Решение
select p.name_program from subject s
join program_subject ps on s.subject_id=ps.subject_id
join program p on p.program_id=ps.program_id
where name_subject in ('Математика', 'Информатика')
group by name_program
having count(*)=2

In [ ]:
# Задание
Создать вспомогательную таблицу applicant,  куда включить id образовательной программы, 
id абитуриента, сумму баллов абитуриентов (столбец itog) в отсортированном сначала по id образовательной программы, 
а потом по убыванию суммы баллов виде (использовать запрос из предыдущего урока).
# Решение
CREATE TABLE applicant
AS
SELECT program.program_id, enrollee.enrollee_id, SUM(result) AS itog
FROM enrollee
INNER JOIN program_enrollee
ON enrollee.enrollee_id = program_enrollee.enrollee_id
INNER JOIN program
ON program_enrollee.program_id = program.program_id
INNER JOIN program_subject
ON program.program_id = program_subject.program_id
INNER JOIN subject
ON program_subject.subject_id = subject.subject_id
INNER JOIN enrollee_subject
ON subject.subject_id = enrollee_subject.subject_id and enrollee_subject.enrollee_id = enrollee.enrollee_id

GROUP BY program.program_id, enrollee.enrollee_id
ORDER BY program.program_id, itog DESC;

In [ ]:
# Задание
Из таблицы applicant, созданной на предыдущем шаге, удалить записи, если абитуриент на выбранную 
образовательную программу не набрал
минимального балла хотя бы по одному предмету (использовать запрос из предыдущего урока).
# Решение
DELETE FROM applicant
USING applicant
INNER JOIN 
(SELECT program.program_id, enrollee.enrollee_id
FROM enrollee
INNER JOIN program_enrollee
ON enrollee.enrollee_id = program_enrollee.enrollee_id
INNER JOIN program
ON program_enrollee.program_id = program.program_id
INNER JOIN program_subject
ON program.program_id = program_subject.program_id
INNER JOIN subject
ON program_subject.subject_id = subject.subject_id 
INNER JOIN enrollee_subject
ON subject.subject_id = enrollee_subject.subject_id and enrollee_subject.enrollee_id = enrollee.enrollee_id
 
WHERE result < min_result
GROUP BY program.program_id, enrollee.enrollee_id) query_in
ON applicant.program_id = query_in.program_id AND applicant.enrollee_id = query_in.enrollee_id;

SELECT * FROM applicant;

In [ ]:
# Задание
Повысить итоговые баллы абитуриентов в таблице applicant на значения 
дополнительных баллов (использовать запрос из предыдущего урока).
# Решение
UPDATE applicant
AS  applicant INNER JOIN
 
(SELECT enrollee_id, SUM(bonus) AS qw
FROM enrollee_achievement
INNER JOIN achievement
USING (achievement_id)
GROUP BY enrollee_id) query_in
USING (enrollee_id)

SET itog = itog + qw;

SELECT * FROM applicant

In [ ]:
# Зачисление студентов
Рассмотрим, как происходит формирование списка абитуриентов, проходящих по конкурсу на образовательные программы. 

В таблицу applicant_order для пояснения включены столбцы «План набора» и «Результат». Каждая программа имеет свой план набора, 
например, план набора образовательной программы с id 1 – 2 человека.  Проходящими по конкурсу считаются первые два человека в 
списке  отсортированных по итоговому баллу абитуриентов, подавших заявление на  образовательную программу. Это абитуриенты с 
id 3 и 2. Аналогично 
отбираются абитуриенты на остальные образовательные программы. В таблице все проходящие по конкурсу выделены зеленым цветом.
# Решение
ALTER TABLE applicant_order ADD str_id INT FIRST;

SELECT *
FROM applicant_order;

In [ ]:
# Задание
Создать таблицу student,  в которую включить абитуриентов, которые могут быть рекомендованы к зачислению  
в соответствии с планом набора. Информацию отсортировать сначала в 
алфавитном порядке по названию программ, а потом по убыванию итогового балла.
# Решение
CREATE TABLE student AS

SELECT name_program, name_enrollee, itog
FROM applicant_order
INNER JOIN enrollee
USING(enrollee_id)
INNER JOIN program
USING(program_id)
WHERE str_id <= plan
ORDER BY name_program, itog DESC;

In [ ]:
# Задание
Отобрать все шаги, в которых рассматриваются вложенные запросы (то есть в названии шага упоминаются вложенные запросы). 
Указать к какому уроку и модулю они относятся. Для этого вывести 3 поля:

в поле Модуль указать номер модуля и его название через пробел;
в поле Урок указать номер модуля, порядковый номер урока (lesson_position) через точку и название урока через пробел;
в поле Шаг указать номер модуля, порядковый номер урока (lesson_position) через точку, порядковый номер шага (step_position) 
через точку и название шага через пробел.
Длину полей Модуль и Урок ограничить 19 символами, при этом слишком длинные надписи обозначить многоточием в конце 
(16 символов - это номер модуля или урока, пробел и  название Урока или Модуля к ним присоединить "..."). 
Информацию отсортировать по возрастанию номеров модулей, порядковых номеров уроков и порядковых номеров шагов.
# Решение
SELECT 
CONCAT(LEFT(CONCAT(module_id,' ',module_name),16),'...') AS Модуль,
CONCAT(LEFT(CONCAT(module_id,'.',lesson_position,' ',lesson_name),16),'...') AS Урок,
CONCAT(module_id,'.',lesson_position,'.',step_position,' ',RTRIM(step_name)) AS Шаг
FROM step
INNER JOIN lesson
USING (lesson_id)
INNER JOIN module
USING (module_id)
WHERE step_name LIKE "%вложенн%"
ORDER BY Модуль, Урок, Шаг;

# Сертификат по ссылке: https://stepik.org/cert/1072336